Revit 2024 API
FabricArea.GetFabricSheetElementIds Method
 Retrieves the identifiers of all the FabricSheet Elements in the FabricArea.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<ElementId> GetFabricSheetElementIds()
Visual Basic
Public Function GetFabricSheetElementIds As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetFabricSheetElementIds()
Return Value
 A collection of ElementIds of FabricSheet elements.
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace